cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Browsers
cask "firefox-developer-edition"
cask "google-chrome"
cask "microsoft-edge"

# Dev
cask "iterm2"
cask "visual-studio-code-insiders"
cask "docker"
cask "tableplus"

# Common Tools
cask "logitech-options"
cask "slack"
cask "chromedriver"
cask "mutify"

# System
brew "zsh-completions"  # Additional completion definitions for zsh
brew "mas"              # Mac App Store CLI
brew "git"              # git
brew "gh"               # GitHub CLI
brew "vim"              # vim
brew "rg"               # ripgrep: super fast grep
brew "htop"             # Improved interactive process viewer
brew "libpq"            # Postgres C API library (may need to run `brew link --force libpq`)
brew "openssl"

# Necessary for Vundle plugin YouCompleteMe
brew "cmake"
brew "mono"
brew "go"
brew "nodejs"

# Ops
brew "awscli"

# Dev
brew "yarn"
brew "pyenv"
brew "node"

# App Store
# mas "1Password 7", id: 1333542190
